Repository: asmecher/subscriptionSSO
Catalog: locale/*/locale.po
Languages: ar, bg_bg, ca_es, cs_cz, es_es, fi, fr_ca, gl_es, hy, id, ka_ge, mk, ms, nb_no, pt_br, pt_pt, ru, ru_ru, sl_si, sr, tr_tr, uk, vi

# plugins.generic.subscriptionSSO.description
source: This plugin delegates subscription checking to an external system for SSO (Single Sign On)-like behavior. When a request comes to OJS with the incoming parameter name specified -- this should be a parameter that OJS does not use internally -- the plugin will contact the verification URL with the value of the parameter appended. If the remote service's result matches the specified regular expression, the user will be considered valid. If not, the user will be redirected to the specified URL.
ar: هذه الإضافة تتوسط في عملية التحقق عند طلب الاشتراك المبني على استعمال أنظمة مصادقة خارجية SSO ذات سلوك مماثل لـ(تسجيل دخول واحد). عندما يرد الطلب إلى نظام المجلات المفتوحة متضمنًا معاملاً ذي اسم معين -- ينبغي أن يكون معاملاً لا يستعمله نظام المجلات المفتوحة داخليًا -- ستقوم الإضافة بالتواصل مع رابط التحقق مع إلحاق المعامل بالرابط. إذا طابقت النتيجة المرسلة من الخدمة الخارجية التعبير الاعتيادي المحدد، سيتم اعتبار المستخدم مفوضًا. إذا لم تتطابق النتيجة، سيتم توجيه المستخدم إلى الرابط المحدد.
bg_bg: Тази добавка (плъгин) делегира проверката на абонамента на външна система SSO (Single Sign On). Когато заявка дойде до OJS с посочено име на входящия параметър – това трябва да е параметър, който OJS не използва вътрешно – плъгинът ще се свърже с URL за проверка с добавена стойност на параметъра. Ако резултатът от отдалечената услуга съвпада с посочения регулярен израз, потребителят ще се счита за валиден. Ако не, потребителят ще бъде пренасочен към посочения URL адрес.
ca_es: Aquest mòdul delega la comprovació de la subscripció a un sistema extern del tipus autenticació única SSO (Single Sign On). Quan arribi una sol·licitud a OJS amb el nom del paràmetre entrant especificat —hauria de ser un paràmetre que OJS no usi internament—, el mòdul contactarà amb l'URL de verificació amb el valor del paràmetre adjunt. Si el resultat del servei remot coincideix amb l'expressió regular especificada, l'usuari/ària es considerarà vàlid. En cas contrari, l'usuari/ària serà redirigit cap a l'URL especificada.
cs_cz: Tento plugin deleguje kontrolu údajů o předplatném na externí systém s SSO (Single Sign On). Pokud vznikne přihlašovací požadavek na OJS s parametrem, který OJS nepoužívá interně , pak plugin kontaktuje ověřovací URL s hodnotou, přiřazenou tomuto parametru. Pokud vzdálená služba odsouhlasí tyto parametry, uživatel bude ověřen. Pokud ne, bude uživatel přesměrován na specifickou URL adresu.
es_es: Este módulo delega la comprobación de la suscripción a un sistema externo del tipo autenticación única (SSO - Single Sign On). Cuando llega una solicitud a OJS con el nombre del parámetro entrante especificado —debería ser un parámetro que OJS no utilice internamente—, el módulo contactará con la URL de verificación con el valor del parámetro adjunto. Si el resultado del servicio remoto coincide con la expresión regular especificada, el usuario/a será considerado válido. Si no, el usuario/a será redirigido a la URL especificada.
fi: Tämä lisäosa siirtää tilausten tarkistuksen ulkoiseen järjestelmään SSO:n (Single Sign On) kaltaisella ratkaisulla. Kun OJS:lle tulee pyyntö, jossa on määritetty saapuvan parametrin nimi - tämän pitäisi olla parametri, jota OJS ei käytä sisäisesti - lisäosa ottaa yhteyttä tarkistusta varten määritettyyn URL-osoitteeseen, johon on liitetty parametrin arvo. Jos etäpalvelun tulos vastaa määritettyä säännöllistä lauseketta, käyttäjä katsotaan kelvolliseksi. Jos ei, käyttäjä ohjataan määritettyyn URL-osoitteeseen.
fr_ca: Ce plugiciel délègue la vérification de l'abonnement à un système externe suivant une authentification unique de type « Single Sign On » . Lorsqu'une demande parvient à OJS avec le nom du paramètre entrant spécifié - il doit par ailleurs s'agir d'un paramètre que OJS n'utilise pas en interne - le plugiciel contactera l'URL de vérification en y concaténant la valeur du paramètre. Si le résultat du service distant correspond à l'expression régulière spécifiée, l'utilisateur-trice sera considéré-e comme valide. Sinon, l'utilisateur-trice sera redirigé-e vers l'URL spécifiée.
gl_es: Este complemento delega a verificación da subscrición a un sistema externo semellante ao SSO (Single Sign On, inicio de sesión único). Cando unha solicitude chega a OJS co nome do parámetro entrante especificado -este debería ser un parámetro que OJS non usa internamente- o complemento contactará co URL de verificación co valor do parámetro engadido. Se o resultado do servizo remoto coincide coa expresión regular especificada, o usuario/a considerarase válido/a. Se non, o usuario/a será redirixido/a ao URL especificado.
hy: Այս փլագինը պատվիրակում է բաժանորդագրության ստուգումը արտաքին համակարգին՝ SSO (Single Sign On) նման վարքագծի համար: Երբ հարցումը գալիս է OJS մուտքային պարամետրի անունով, սա պետք է լինի պարամետր, որը OJS-ը չի օգտագործում ներսում, հավելվածը կապ կհաստատի հաստատման URL-ի հետ՝ պարամետրի արժեքով: Եթե հեռակառավարման ծառայության արդյունքը համընկնում է նշված կանոնավոր արտահայտության հետ, օգտվողը կհամարվի վավեր: Եթե ոչ, օգտվողը կվերահղվի նշված URL-ին:
id: Plugin ini mengalihkan pemeriksaan langganan kepada sistem eksternal untuk perilaku menyerupai SSO (Single Sign-On). Ketika ada permintaan masuk ke OJS dengan parameter tertentu-- parameter yang belum digunakan OJS secara internal -- plugin akan menghubungi URL verifikasi dengan nilai parameter yang ditambahkan. Jika hasil layanan jarak jauh cocok dengan ekspresi reguler yang ditentukan, pengguna akan dianggap valid. Jika tidak, pengguna akan diarahkan ke URL yang ditentukan.
ka_ge: ეს პლაგინი გადასცემს შემოწმებას გარე სისტემას SSO (Single Sign On) მსგავსი ქცევისთვის. როდესაც მოთხოვნა მოდის OJS- ში, მითითებულია შემომავალი პარამეტრის სახელი - ეს უნდა იყოს პარამეტრი, რომელსაც OJS არ იყენებს შინაგანად - დანამატი დაუკავშირდება დამადასტურებელ URL- ს თანდართული პარამეტრის მნიშვნელობით. თუ დისტანციური სერვისის შედეგი ემთხვევა მითითებულ რეგულარულ გამოხატვას, მომხმარებელი მართებულად ჩაითვლება. თუ არა, მომხმარებელი გადამისამართდება მითითებულ URL- ზე.
mk: Овој плагин овозможува проверка на однесувањето на надворешниот систем за SSO (Single Sign On). Кога ѓе дојде барање до OJS со специфицирано име -- ова може да биде параметар кој не се користи внатрешно во OJS -- плагинот ќе ја верифицира УРЛ адресата со вредност на додадените параметри. Ако резултатот од далечинскиот сервер ги спари дефинираните податоци, корисникот ќе се смета за валиден. Доколку не се спарат, корисникот ќе биде преупатен на определена УРЛ адреса.
ms: Pluigin ini mewakilkan semakan langganan kepada sistem luaran untuk tingkah laku seperti SSO (Single Sign On). Apabila permintaan datang kepada OJS dengan nama parameter masuk ditentukan -- ini harus menjadi parameter yang OJS tidak gunakan secara dalaman -- pemalam akan menghubungi URL pengesahan dengan nilai parameter yang dilampirkan. Jika keputusan perkhidmatan jauh sepadan dengan ungkapan biasa yang ditentukan, pengguna akan dianggap sah. Jika tidak, pengguna akan diubah hala ke URL yang ditentukan.
nb_no: Dette programtillegget delegerer abonnementskontroll til et eksternt system for SSO (Single Sign On) -lignende oppførsel. Når en forespørsel kommer til OJS med det angitte innkommende parameternavnet - dette skal være en parameter som OJS ikke bruker internt - vil programtillegget kontakte bekreftelses-URL-en med verdien av parameteren som er lagt til. Hvis resultatet av fjerntjenesten samsvarer med det spesifiserte regulære uttrykket, blir brukeren ansett som gyldig. Hvis ikke, vil brukeren bli omdirigert til den angitte URL-en.
pt_br: Este plugin delega a verificação de assinatura a um sistema externo para um comportamento semelhante ao SSO (Single Sign On/ Login Único). Quando uma solicitação é enviada ao OJS com o nome do parâmetro de entrada especificado — este deve ser um parâmetro que o OJS não usa internamente — o plugin entrará em contato com a URL de verificação com o valor do parâmetro anexado. Se o resultado do serviço remoto corresponder à expressão regular especificada, o usuário será considerado válido. Caso contrário, o usuário será redirecionado para o URL especificado.
pt_pt: Este plugin delega a verificação de assinatura a um sistema externo para um comportamento semelhante ao SSO (Single Sign On/ Login Único). Quando uma solicitação é enviada ao OJS com o nome do parâmetro de entrada especificado — este deve ser um parâmetro que o OJS não usa internamente — o plugin entrará em contato com o URL de verificação com o valor do parâmetro anexado. Se o resultado do serviço remoto corresponder à expressão regular especificada, o utilizador será considerado válido. Caso contrário, o utilizador será redirecionado para o URL especificado.
ru: Этот плагин делегирует проверку подписки внешней системе для поведения, подобного SSO (Single Sign On). Когда в OJS поступает запрос с заданным названием входного параметра (это должен быть параметр, который сам OJS внутри не использует), плагин связывается с URL верификации, добавляя значение этого параметра. Если результат внешнего сервиса совпадает с заданным регулярным выражением, то пользователь считается корректным. Если нет, то пользователь будет перенаправлен на заданный URL.
ru_ru: Плагин делегирует проверку подписки внешней системе, реализуя поведение аналогичное SSO (Single Sign On). Когда в OJS поступает запрос с определённым именем входящего параметра (это должен быть параметр, который OJS не использует внутри себя), плагин будет обращаться на URL верификации, добавляя значение этого параметра. Если ответ этой удалённой службы соответствует заданному регулярному выражению, пользователь будет считаться корректным. Если не соответствует, то пользователь будет перенаправлен на заданный URL.
sl_si: Vtičnik delegira preverjanje naročnine zunanjemu SSO (Single Sign On) sistemu. Ko do OJS pride zahteva z uporabniškim imenom kot vhodnim parametrom - to naj bi bil parameter, ki ga OJS interno ne uporablja - bo ta vtičnik kontaktiral verifikacijski URL in posredoval vrednost parametra. Če bo rezultat zunanjega servisa ustrezal specificiranemu regularnemu izrazu, bo uporabnik smatran kot veljaven. V nasprotnem primeru, bo uporabnik preusmerjen na specificiran URL.
sr: Ovaj dodatak delegira proveru pretplate na spoljni sistem za ponašanje nalik na SSO (Single Sign On). Kada zahtev dođe u OJS sa navedenim imenom dolaznog parametra – ovo bi trebalo da bude parametar koji OJS ne koristi interno – dodatak će kontaktirati verifikacioni URL sa dodanom vrednošću parametra. Ako se rezultat udaljene usluge podudara sa navedenim regularnim izrazom, korisnik će se smatrati važećim. Ako nije, korisnik će biti preusmeren na navedenu URL adresu.
tr_tr: Bu eklenti, SSO (Tek Oturum Açma) benzeri şekilde abonelik denetimini harici bir sisteme devreder. Gelen parametre adı belirtilmiş bir istek OJS'e geldiğinde - bu, OJS'nin dahili olarak kullanmadığı bir parametre olmalıdır - eklenti, eklenen parametrenin değeri doğrulama URL'siyle iletişim kurar. Uzak hizmetin sonucu belirtilen normal ifadeyle eşleşirse, kullanıcı geçerli kabul edilir. Aksi takdirde, kullanıcı belirtilen URL'ye yönlendirilir.
uk: Цей плагін делегує перевірку підписки зовнішній системі для поведінки, подібної до SSO (Single Sign On). Коли в OJS поступає запит із завданою назвою вхідного параметра (це має бути параметр, який сам OJS усередині не використовує), плагін зв'язується з URL-адресою верифікації, додаючи значення цього параметра. Якщо результат зовнішнього сервісу співпадає с завданим регулярним вираженням, то користувач вважається коректним. Якщо ні, то користувач буде перенаправлений на завданий URL.
vi: Plugin này ủy quyền kiểm tra thuê bao cho một hệ thống bên ngoài giống như SSO (Đăng nhập một lần). Khi một yêu cầu đến OJS với tên tham số đến được chỉ định - đây phải là tham số mà OJS không sử dụng nội bộ - plugin sẽ liên hệ với URL xác minh với giá trị của tham số được nối. Nếu kết quả của dịch vụ từ xa khớp với biểu thức chính quy định, người dùng sẽ được coi là hợp lệ. Nếu không, người dùng sẽ được chuyển hướng đến URL được chỉ định.

# plugins.generic.subscriptionSSO.settings.verificationUrl.required
source: The verification URL is required and must contain a valid URL.
ar: عنوان رابط التحقق مطلوب حتمًا وينبغي أن يكون عنوان رابط صالح.
bg_bg: URL адресът за проверка е задължителен и трябва да съдържа валиден URL адрес.
ca_es: L'URL de verificació és obligatori i ha de contenir un URL vàlid.
cs_cz: Ověřovací URL musí být zadáno a musí obsahovat platnou URL adresu.
es_es: La URL de verificación es obligatoria y debe contener una URL válida.
fi: Tarkistus URL on vaadittu tieto ja siinä pitää olla kelvollinen URL.
fr_ca: L'URL de vérification est obligatoire et doit contenir un URL valide.
gl_es: O URL de verificación é obrigatorio e debe conter un URL válido.
hy: Վավերականության URL-ը պարտադիր է և պետք է պարունակի վավեր URL:
id: URL verifikasi diperlukan dan harus berupa URL yang valid.
ka_ge: გადამისამართების URL აუცილებელია და უნდა შეიცავდეს სწორ URL-ს.
mk: УРЛ за верификација е задолжително и мора да соджи валидно УРЛ.
ms: URL pengesahan diperlukan dan mesti mengandungi URL yang sah.
nb_no: Verifikasjons-URL må fylles ut og må være en gyldig URL.
pt_br: A URL de verificação é obrigatória e deve conter uma URL válida.
pt_pt: O URL de verificação é obrigatório e deve conter um URL válido.
ru: URL верификации обязателен и должен содержать корректный URL.
ru_ru: URL верификации обязателен и должен содержать корректный URL.
sl_si: Verifikacijski URL je obvezen in mora vsebovati veljaven URL.
sr: Verifikacija URL-a je obaveza i mora da sadrži validan URL.
tr_tr: Doğrulama URL'si zorunlu ve geçerli bir URL olmalıdır.
uk: URL-адреса верифікації є обов'язковою і повинна містити коректну URL.
vi: URL xác thực là bắt buộc và phải chứa một URL hợp lệ.
