Repository: asmecher/subscriptionSSO
Catalog: locale/*/locale.po
Languages: ar, bg_bg, ca_es, cs_cz, es_es, fi, fr_ca, gl_es, hy, id, ka_ge, mk, ms, nb_no, pt_br, pt_pt, ru, ru_ru, sl_si, sr, tr_tr, uk, vi

# plugins.generic.subscriptionSSO.settings
source: Settings
ar: الإعدادات
bg_bg: Настройки
ca_es: Configuració
cs_cz: Nastavení
es_es: Ajustes
fi: Asetukset
fr_ca: Paramètres
gl_es: Axustes
hy: Կարգավորումներ
id: Pengaturan
ka_ge: პარამეტრები
mk: Поставки
ms: Tetapan
nb_no: Innstillinger
pt_br: Configurações
ru: Настройки
ru_ru: Настройки
sl_si: Nastavitve
sr: Podešavanja
tr_tr: Ayarlar
uk: Налаштування
vi: Cài đặt

# plugins.generic.subscriptionSSO.subscriptionSSOSettings
source: Subscription Single Sign-On Settings
ar: إعدادات الاشتراك عبر تسجيل الدخول الواحد
bg_bg: Настройки за Single Sign-On
ca_es: Configuració de la subscripció d'autenticació única
cs_cz: Nastavení SSO (Single Sign-On) předplatného
es_es: Ajustes de suscripción de autenticación única
fi: Tilauksen kertakirjautumisasetukset
fr_ca: Paramètres de l'abonnement par authentification unique (Single Sign-On)
gl_es: Configuración da subscrición SSO (inicio de sesión único)
hy: Բաժանորդագրության Single Sign-On կարգավորումներ
id: Pengaturan Langganan Single Sign-On
ka_ge: გამოწერის ერთი შესვლის პარამეტრები
mk: Поставки за претплата со единечна најава
ms: Tetapan Log Masuk Tunggal Langganan
nb_no: Abbonements Single Sign-On Innstillinger
pt_br: Configurações da assinatura Single Sign-On (Login Único)
pt_pt: Configurações da subscrição Single Sign-On (Login Único)
ru: Настройки SSO (Single Sign-On) подписки
ru_ru: Настройки SSO для подписки
sl_si: Naročniške SSO nastavitve
sr: Podešavanje jednokratne pretplate
tr_tr: Tek Oturum Açma Abonelik Ayarları
uk: Налаштування SSO (Single Sign On) для підписки
vi: Cài đặt thuê bao đăng nhập một lần

# plugins.generic.subscriptionSSO.settings.description
source: Use the following form to configure the external service that will provide confirmation of subscription status to OJS's subscription content.
ar: استعمل النموذج الآتي لتهيئة الخدمة الخارجية التي توفر التأكيد لحالة الاشتراك إلى محتوى الاشتراك في نظام المجلات المفتوحة.
bg_bg: Използвайте следния формуляр, за да конфигурирате външната услуга, която ще предостави потвърждение на състоянието на абонамента към съдържанието на абонамента на OJS.
ca_es: Feu servir el següent formulari per configurar el servei extern que proporcionarà la confirmació de l'estat de la subscripció en el contingut de subscripció d'OJS.
cs_cz: Následující formulář použijte k nastavení externí služby, která bude poskytovat potvrzení stavu předplatného pro předplatné obsahu OJS.
es_es: Utilice el siguiente formulario para configurar el servicio externo que proporcionará la confirmación del estado de la suscripción en el contenido de suscripción de OJS.
fi: Määritä seuraavalla lomakkeella ulkoinen palvelu, joka antaa OJS:lle vahvistuksen tilauksen tilasta.
fr_ca: Utiliser le formulaire suivant pour configurer le service externe qui fournira une confirmation du statut d'abonnement au contenu souscrit d'OJS.
gl_es: Utilice o seguinte formulario para configurar o servizo externo que proporcionará a confirmación do estado da subscrición ao contido de subscrición de OJS.
hy: Օգտագործեք հետևյալ ձևը՝ արտաքին ծառայությունը կարգավորելու համար, որը կհաստատի բաժանորդագրության կարգավիճակը OJS-ի բաժանորդագրության բովանդակությանը:
id: Gunakan formulir berikut untuk mengkonfigurasi layanan eksternal yang akan memberikan konfirmasi status langganan ke konten langganan OJS.
ka_ge: გამოიყენეთ შემდეგი ფორმა გარე სერვისის კონფიგურაციისთვის, რომელიც უზრუნველყოფს OJS-ის სააბონენტო შინაარსის გამოწერის სტატუსის დადასტურებას.
mk: Употребете го следниот формулар за да ја конфигурирате надворешната услуга која ќе ви овозможи потврда за статусот на вашата претплата на претплатничката соджина на OJS.
ms: Gunakan borang berikut untuk mengkonfigurasi perkhidmatan luaran yang akan memberikan pengesahan status langganan ke kandungan langganan OJS.
nb_no: Bruk følgende skjema for å konfigurere den eksterne tjenesten som gir bekreftelse på abonnementsstatus til OJS abonnementsinnhold.
pt_br: Use o formulário a seguir para configurar o serviço externo que fornecerá a confirmação do status da assinatura para o conteúdo da assinatura do OJS.
pt_pt: Use o formulário para configurar o serviço externo que fornecerá a confirmação do status da subscrição para o conteúdo assinado no OJS.
ru: Используйте следующую форму для настройки внешнего сервиса, который будет обеспечивать подтверждение статуса подписки для подписного контента в OJS.
ru_ru: Используйте следующую форму для настройки внешней службы, которая будет подтверждать статус подписки на подписной контент OJS.
sl_si: Uporabite spodnji obrazec za nastavitev zunanjega servisa, ki bo zagotavljal potrditev naročniškega statusa za poterbe naročniških vsebin v OJS.
sr: Koristi sledeći obrazac za podešavanje spoljne usluge koja će da obezbedi potvrdu statusa pretplate za sadržaj pretplate OJS-a.
tr_tr: OJS'nin abonelik içeriğine abonelik onayı sağlayacak harici hizmeti yapılandırmak için aşağıdaki formu kullanın.
uk: Використовуйте таку форму для налаштування зовнішнього сервісу, який буде забезпечувати підтвердження статусу підписки для підписного контенту в OJS.
vi: Sử dụng mẫu sau để định cấu hình dịch vụ bên ngoài sẽ cung cấp xác nhận trạng thái đăng ký cho nội dung đăng ký của OJS.

# plugins.generic.subscriptionSSO.settings.incomingParameterName
source: Incoming parameter name
ar: اسم المعامل الوارد
bg_bg: Име на входящ параметър
ca_es: Nom del paràmetre entrant
cs_cz: Jméno vstupního parametru
es_es: Nombre del parámetro entrante
fi: Saapuvan parametrin nimi
fr_ca: Nom du paramètre entrant
gl_es: Nome do parámetro entrante
hy: Մուտքային պարամետրի անունը
id: Nama parameter yang masuk
ka_ge: შემომავალი პარამეტრის სახელი
mk: Име на дојдовен параметар
ms: Nama parameter masuk
nb_no: Innkommende paremeternavn
pt_br: Nome do parâmetro recebido
pt_pt: Nome do parâmetro recebido
ru: Название входного параметра
ru_ru: Имя входящего параметра
sl_si: Ime vhodnega parametra
sr: Ime dolaznog parametra
tr_tr: Gelen parametre adı
uk: Назва вхідного параметра
vi: Tên tham số đến

# plugins.generic.subscriptionSSO.settings.incomingParameterName.required
source: The incoming parameter name is required and must contain only alphanumeric characters.
ar: اسم المعامل الوارد مطلوب حتمًا وينبغي أن يحتوي فقط على محارف نصية ورقمية.
bg_bg: Името на входящия параметър е задължително и трябва да съдържа само буквено-цифрови знаци.
ca_es: El nom del paràmetre entrant és obligatori i només pot contenir caràcters alfanumèrics.
cs_cz: Jméno vstupního parametru je požadováno a smí obsahovat pouze alfanumerické znaky.
es_es: El nombre del parámetro entrante es obligatorio y debe contener únicamente caracteres alfanuméricos.
fi: Saapuvan parametrin nimi vaaditaan ja saa sisältää vain aakkosnumeerisia merkkejä.
fr_ca: Le nom du paramètre entrant est obligatoire et ne peut contenir que des caractères alphanumériques.
gl_es: O nome do parámetro entrante é obrigatorio e debe conter só caracteres alfanuméricos.
hy: Մուտքային պարամետրի անունը պահանջվում է և պետք է պարունակի միայն տառա-թվային նիշեր:
id: Nama parameter ini diperlukan dan hanya boleh terdiri dari karakter alfanumerik.
ka_ge: შემომავალი პარამეტრის სახელი აუცილებელია და უნდა შეიცავდეს მხოლოდ ალფანუმერულ სიმბოლოებს.
mk: Името на дојдовниот параметар е задолжително и мора да содржи само алфанумерички знаци.
ms: Nama parameter masuk diperlukan dan mesti mengandungi aksara alfanumerik sahaja.
nb_no: Det innkommende parameternavnet er obligatorisk og må bare inneholde alfanumeriske tegn.
pt_br: O nome do parâmetro recebido é obrigatório e deve conter apenas caracteres alfanuméricos.
pt_pt: O nome do parâmetro recebido é obrigatório e deve conter apenas caracteres alfanuméricos.
ru: Название входного параметра обязательно и должно содержать только буквы и цифры.
ru_ru: Имя входящего параметра обязательно и должно состоять только из букв латинского алфавита и цифр.
sl_si: Ime vhodnega parametra je obvezno in lahko vsebuje le alfanumerične znake.
sr: Naziv dolaznog parametra je obavezan i mora da sadrži samo alfanumeričke karaktere.
tr_tr: Gelen parametre adı zorunludur ve yalnızca alfanumerik karakterlerden oluşmalıdır.
uk: Назва вхідного параметра є обов'язковою і повинна містити тільки буквено-цифрові знаки.
vi: Tên tham số đến là bắt buộc và chỉ chứa các ký tự chữ và số.

# plugins.generic.subscriptionSSO.settings.verificationUrl
source: Verification URL
ar: عنوان رابط التحقق
bg_bg: URL за проверка
ca_es: URL de verificació
cs_cz: Ověřovací URL
es_es: URL de verificación
fi: Vahvistuksen URL-osoite
fr_ca: URL de vérification
gl_es: URL de verificación
hy: Վավերականության URL
id: URL Verifikasi
ka_ge: დადასტურების URL
mk: УРЛ за верификација
ms: URL pengesahan
nb_no: Verifikasjons-URL
pt_br: URL de verificação
pt_pt: URL de verificação
ru: URL верификации
ru_ru: URL верификации
sl_si: Verifikacijski URL
sr: Verfikacija URL
tr_tr: Doğrulama URL'si
uk: URL-адреса верифікації
vi: URL xác thực

# plugins.generic.subscriptionSSO.settings.resultRegexp
source: Verification Regular Expression
ar: التعبير الاعتيادي للتحقق
bg_bg: Регулярен израз за проверка
ca_es: Expressió regular de verificació
cs_cz: Regulární výraz ověření
es_es: Expresión regular de verificación
fi: Vahvistuksen säännöllinen lauseke
fr_ca: Expression régulière de vérification
gl_es: Expresión regular de verificación
hy: Վավերականության կանոնավոր արտահայտություն
id: Pernyataan Umum Verifikasi
ka_ge: რეგულარული გამოხატვის შემოწმება
mk: Верификација на регуларното прикажување
ms: Pengesahan Ungkapan Biasa
nb_no: Verifikasjons Regular Expression
pt_br: Verificação de Expressão Regular
pt_pt: Verificação da Expressão Regular
ru: Регулярное выражение для верификации
ru_ru: Регулярное выражение для верификации
sl_si: Verifikacijski regularni izraz
sr: Regularni izraz verifikacije
tr_tr: Doğrulama Düzenli İfadesi
uk: Регулярне вираження для верифікації
vi: Biểu thức chính quy xác thực

# plugins.generic.subscriptionSSO.settings.resultRegexp.required
source: The verification regular expression is a required field and must contain a valid regular expression.
ar: التعبير الاعتيادي للتحقق مطلوب حتمًا وينبغي أن يكون تعبير اعتيادي صالح.
bg_bg: Регулярният израз за проверка е задължително поле и трябва да съдържа валиден регулярен израз.
ca_es: L'expressió regular de verificació és un camp obligatori i ha de contenir una expressió regular vàlida.
cs_cz: Regulární ověřovací výraz musí být zadán a musí obsahovat platný regulární výraz.
es_es: La expresión regular de verificación es un campo obligatorio y debe contener una expresión regular válida.
fi: Vahvistuksen säännöllinen lauseke on pakollinen kenttä, ja sen on sisällettävä kelvollinen säännöllinen lauseke.
fr_ca: L'expression régulière de vérification est un champ obligatoire et doit contenir une expression régulière valide.
gl_es: A expresión regular de verificación é un campo obrigatorio e debe conter unha expresión regular válida.
hy: Վավերականության կանոնավոր արտահայտությունը պարտադիր դաշտ է և պետք է պարունակի վավեր կանոնավոր արտահայտություն:
id: Pernyataan umum verifikasi adalah kolom wajib dan harus mengandung pernyataan umum verifikasi yang valid.
ka_ge: გადამოწმების რეგულარული გამოხატვა არის სავალდებულო ველი და უნდა შეიცავდეს მართებულ რეგულარულ გამოხატვას.
mk: Верификацијата на регуларното прикажување е барано поле и мора да содржи вистинско регуларно прикажување.
ms: Pengesahan ungkapan biasa ialah medan yang diperlukan dan mesti mengandungi ungkapan biasa yang sah.
nb_no: Verifikasjons regular expression må fylles ut og må være et gyldig regular expression.
pt_br: A verificação de expressão regular é um campo obrigatório e deve conter uma expressão regular válida.
pt_pt: A verificação da expressão regular é um campo obrigatório e deve conter uma expressão regular válida.
ru: Поле «Регулярное выражение для верификации» обязательно и должно содержать корректное регулярное выражение.
ru_ru: Регулярное выражение для верификации является обязательным полем и должно содержать корректное регулярное выражение.
sl_si: Verifikacijski regulrni izraz je obvezen in mora vsebovati veljav regularni izraz.
sr: Regularni izraz za verifikaciju je obavezno polje i mora da sadrži važeći regularni izraz.
tr_tr: Doğrulama düzenli ifadesi zorunlu bir alandır ve geçerli bir düzenli ifade olmalıdır.
uk: Поле регулярного вираження для верифікації є обов'язковим і повинне містити коректне регулярне вираження.
vi: Biểu thức chính quy xác thực là trường bắt buộc và phải chứa biểu thức chính quy hợp lệ.

# plugins.generic.subscriptionSSO.settings.redirectUrl
source: Redirect URL
ar: عنوان رابط إعادة التوجيه
bg_bg: URL за пренасочване
ca_es: URL de redireccionament
cs_cz: URL přesměrování
es_es: URL de redirección
fi: Uudelleenohjauksen URL-osoite
fr_ca: URL de redirection
gl_es: URL de redirección
hy: Վերահղման URL
id: Mengarahkan URL
ka_ge: გადამისამართების URL
mk: УРЛ за пренасочување
ms: Ubah hala URL
nb_no: Videresendings URL
pt_br: URL de redirecionamento
pt_pt: URL de redirecionamento
ru: URL для перенаправления
ru_ru: URL перенаправления
sl_si: Preusmeritveni URL
sr: Preusmeravanje URL
tr_tr: Yönlendirme URL'si
uk: URL-адреса для перенаправлення
vi: URL chuyển hướng

# plugins.generic.subscriptionSSO.settings.redirectUrl.required
source: The redirect URL is required and must contain a valid URL.
ar: عنوان رابط إعادة التوجيه مطلوب حتمًا وينبغي أن يكون عنوان رابط صالح.
bg_bg: URL адресът за пренасочване е задължителен и трябва да съдържа валиден URL адрес.
ca_es: L'URL de redireccionament és obligatori i ha de contenir un URL vàlid.
cs_cz: URL přesměrování musí být zadáno a musí obsahovat platnou URL adresu.
es_es: La URL de redirección es obligatoria y debe contener una URL válida.
fi: Uudelleenohjauksen URL-osoite on pakollinen, ja sen on sisällettävä kelvollinen URL-osoite.
fr_ca: L'URL de redirection est obligatoire et doit contenir un URL valide.
gl_es: O URL de redirección é obrigatorio e debe conter un URL válido.
hy: Վերահղման URL-ը պարտադիր է և պետք է պարունակի վավեր URL:
id: URL pengalih diperlukan dan harus berupa URL yang valid.
ka_ge: გადამისამართების URL აუცილებელია და უნდა შეიცავდეს სწორ URL-ს.
mk: УРЛ за пренасочување е задолжително и мора да содржи валидно УРЛ.
ms: URL ubah hala diperlukan dan mesti mengandungi URL yang sah.
nb_no: Videresendings-URL må fylles inn og må være en gyldig URL.
pt_br: A URL de redirecionamento é necessária e deve conter uma URL válida.
pt_pt: O URL de redirecionamento é obrigatório e deve conter um URL válido.
ru: URL для перенаправления обязателен и должен содержать корректный URL.
ru_ru: URL перенаправления обязателен и должен содержать корректный URL.
sl_si: Preusmeritveni URL je obvezen in mora vsebovati veljaven URL.
sr: Preusmeravanje URL je obavezno i mora da sadrži važeći URL.
tr_tr: Yönlendirme URL'si zorunludur ve geçerli bir URL olmalıdır.
uk: URL-адреса для перенаправлення є обов'язковою і повинна містити коректну URL.
vi: URL chuyển hướng là bắt buộc và phải chứa một URL hợp lệ.

# plugins.generic.subscriptionSSO.settings.hoursValid
source: Hours Valid
ar: ساعات الصلاحية
bg_bg: Валидни часове
ca_es: Hores vàlides
cs_cz: Hodiny platnosti
es_es: Horas válidas
fi: Tuntia voimassa
fr_ca: Nombre d'heures de validité
gl_es: Horas válidas
hy: Վավեր ժամեր
id: Waktu Valid
ka_ge: მოქმედი საათები
mk: Валидни часови
ms: Waktu Sah
nb_no: Timer gyldig
pt_br: Horas Válidas
pt_pt: Horas Válidas
ru: Валидно (часов)
ru_ru: Период валидности (в часах)
sl_si: Veljavnost v urah
sr: Važeći sati
tr_tr: Geçerli Saatler
uk: Валідно годин
vi: Giờ hợp lệ

# plugins.generic.subscriptionSSO.settings.hoursValid.required
source: The maximum number of hours the session is valid must be an integer.
ar: أقصى عدد من الساعات لصلاحية الجلسة ينبغي أن يكون عددًا صحيحًا.
bg_bg: Максималният брой часове, през които сесията е валидна, трябва да бъде цяло число.
ca_es: El nombre màxim d'hores que la sessió és vàlida ha de ser un nombre enter.
cs_cz: Maximální počet hodin platnosti ověření – je třeba zadat celé číslo.
es_es: El número máximo de horas que la sesión es válida debe ser un número entero.
fi: Istunnon voimassaoloajan enimmäismäärän on oltava kokonaisluku.
fr_ca: Le nombre maximal d'heures de validité de la session doit être un entier.
gl_es: O número máximo de horas de vixencia da sesión debe ser un número enteiro.
hy: Կապի վավեր ժամերի առավելագույն քանակը պետք է լինի ամբողջ թիվ:
id: Jumlah maksimum lamanya sesi tetap valid harus bernilai integer.
ka_ge: სესიის მოქმედი საათების მაქსიმალური რაოდენობა უნდა იყოს მთელი რიცხვი.
mk: Максималниот број на часови во кои сесијата е валидна мора да биде цел број.
ms: Bilangan maksimum jam sesi sah mestilah integer.
nb_no: Det maksimale antallet timer sesjonen er gyldig må være et heltall.
pt_br: O número máximo de horas que a sessão é válida deve ser um número inteiro.
pt_pt: O número máximo de horas em que a sessão é válida deve ser um número inteiro.
ru: Максимальное количество часов, в течение которого сессия считается валидной. Должно быть целым числом.
ru_ru: Максимальное число часов, которое сессия считается валидной. Должно быть целым числом.
sl_si: Največje število ur veljavnosti seje mora biti integer.
sr: Maksimalan broj sati tokom kojih je sesija važeća mora biti ceo broj.
tr_tr: Oturumun geçerli olabileceği maksimum saat bir tamsayı olmalıdır.
uk: Максимальна кількість годин, протягом яких сеанс є дійсним, має бути цілим числом.
vi: Số giờ tối đa của phiên là hợp lệ phải là số nguyên.

# plugins.generic.subscriptionSSO.name
source: Subscription SSO Plugin
ar: إضافة الاشتراك SSO
bg_bg: Добавка (плъгин) за SSO абонамент
ca_es: Mòdul de subscripció SSO
cs_cz: Plugin externího ověřování SSO
es_es: Módulo de suscripción SSO
fi: SSO tilaukset -lisäosa
fr_ca: Plugiciel d'abonnement par authentification unique (Single Sign-On)
gl_es: Complemento de subscrición SSO
hy: SSO բաժանորդագրության փլագին
id: Plugin Langgan SSO
ka_ge: გამოწერის SSO პლაგინი
mk: Плагин за SSO претплата
ms: Langganan SSO Plugin
nb_no: Abbonements SSO programtillegg
pt_br: Plugin de assinatura SSO (Single Sign On / Login Único)
pt_pt: Plugin de subscrição SSO (Single Sign On / Login Único)
ru: Плагин «SSO для подписки»
ru_ru: Плагин «SSO для подписки»
sl_si: Vtičnik za naročnine preko SSO
sr: SSO dodatak za pretplatu
tr_tr: Tek Oturum Abonelik Eklentisi
uk: Плагін SSO для підписки
vi: Plugin SSO thuê bao
